In [1]:
# get pandas imported so you can do the data sciencey stuff
import pandas as pd

In [2]:
#you don't really need to do this, but if it's a long filepath name then doing this makes life easier
data_filepath = 'train.csv'

In [3]:
#importing the data
data = pd.read_csv(data_filepath)

In [4]:
#take a look at it
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#look at it some more
data.describe()
#age must have some missing entries.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
#what are the columns? let's see all of them.
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
#make a new column that replaces missing age values with the median age
age_col = data.Age

In [8]:
median_age = age_col.median()

In [28]:
data['filled_age'] = age_col.fillna(median_age)

In [30]:
#count how many nulls, to make sure filled_age is actually filled.
data['filled_age'].isnull().sum()

0

In [31]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'filled_age',
       'sex_as_numbers'],
      dtype='object')

In [32]:
#change sex into a 0 or 1, 1 for male and 0 for female
sexnum =[] 
for x in range(len(data.Sex)):
    if data.Sex[x] == 'male':
        sexnum.append(1)
    else:
        sexnum.append(0)
        
data['sex_as_numbers'] = sexnum

In [33]:
#make a list of the features that we're going to use
features = ['Pclass', 'sex_as_numbers', 'filled_age']
print(features)
data.head()

['Pclass', 'sex_as_numbers', 'filled_age']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,filled_age,sex_as_numbers
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0,1

In [34]:
#set X, what we're going to train on, as the part of the data that only corresponds to the features we are interested in.
X = data[features]

In [35]:
#make sure we're ready to go on the stats by checking for nulls
X.isnull().sum()

Pclass            0
sex_as_numbers    0
filled_age        0
dtype: int64

In [36]:
from sklearn.linear_model import LogisticRegression

In [39]:
#set y as the independent variable, that we want to predict
#fit the model to our X data and y 
#then get the r^2 value using score function
y = data.Survived
model = LogisticRegression()
model = model.fit(X,y)
# #print(X)
# print(y)
model.score(X,y)

0.7968574635241302

In [51]:
#read in the test data, now that the model is trained
test = pd.read_csv('test.csv')

In [56]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [58]:
#change the features of the test set to match the training set
#first, fill in the missing ages and make a new column for that
median_age = test.Age.median()
test['filled_age'] = test['Age'].fillna(median_age)

#next, convert sex to a numeric variable
sexnum =[] 
for x in range(len(test.Sex)):
    if test.Sex[x] == 'male':
        sexnum.append(1)
    else:
        sexnum.append(0)
        
test['sex_as_numbers'] = sexnum

In [59]:
#given the values in our test set, what does it predict as new Y values? first set X2 as the features we'll
#use for the test data
X2 = test[features]

In [61]:
#go in and actually get the predictions using our model from the training set
test_predictions = model.predict(X2)

In [72]:
#make a new dataframe that has the proper labels and data and then write it to a CSV file
predictions_file = pd.DataFrame({
    'PassengerId': test['PassengerId'],
    'Survived': test_predictions
    })

predictions_file.to_csv('submission.csv', index=False)